// 1.მოცემულია ცვლადი, რომლის მნიშვნელობაა 100.
// დაწერეთ if პირობა, თუ ცვლადის მნიშვნელობა ნაკლებია 50ზე დაუბეჭდოს - ნაკლებია 50ზე, თუ ცვლადის მნიშვნელობა მეტია 20ზე დაიბეჭდოს მეტია 20ზე, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - შეცდომა.
let num = 100;

if (num < 50) {
    console.log("ნაკლებია 50-ზე");
} else if (num > 20) {
    console.log("მეტია 20-ზე");
} else {
    console.log("შეცდომა");
}


// 2.მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. ახალი if ის სინტაქსით დაწერეთ, თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true, ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; 
let name = "მარიამ";

let myname = (name === 'მარიამ') ? 'true' : 'false';
console.log(myname);

// 3.მოცემულია ცვლადი, რომლის მნიშვნელობაა მარიამ. switch case ის საშუალებით დაწერეთ, თუ ცვლადის მნიშვნელობა უდრის მარიამ-ს დაიბეჭდოს - true,ყველა სხვა დანარჩენ შემთხვევაში დაიბეჭდოს - false; 
let firstname = "მარიამ";

switch (firstname) {
    case "მარიამ":
        console.log("true");
        break;    
    default:
        console.log("false");         
}

